面试官好，我叫李大庆，就读于沈阳航空航天大学，23届毕业生，专业是软件工程，今天来面试贵司的前端实习岗位
首先，我有多段实习经历，最早是大二开始在校企没课的时候实习，更多的是在学习，参与一些公司小的功能模块开发，比如做 了数据可视化大屏，做了一个h5的在线报告平台，
现在数据大屏还在公司大厅显示器上展示，报告平台现在也成为公司行业报告方面的一个产品吧。
大三的时候在学校里面学长开的公司做前端开发，做了两个学期，也是在没课的时候去做开发，从0 - 1负责了两个项目，比较值得讲的是做了一个评审系统，为学校的1500多名教师提供评审晋升服务
通过和团队的协作，和老师积极沟通，顺利在评审开始前完成了系统开发，保证评审的稳定进行。
最近一段实习就是暑期678月在美团大搜做这个前端实习，做了一些中后台项目迭代开发。值得说的是用checkbox 结合 monaco编辑器做了一个json节点筛选工具，
8月份参加 字节青训营，我们小团队做了一个前端监控的。完成了基本功能。
最近10月参加阿里终端练习生活动，带了6个人的小团队，做了一个广告投放分发的js库，完成了基本功能结业了。




面试官您好, 我叫李大庆, 是沈阳航空航天大学的软件工程专业23届的毕业生, 成绩良好, 
在校期间做了很多实践, 在大学期间基本都在实习或者工作,
期间做了一些web方向课程的助教, 辅导大一大二同学, 解答一些简单的问题

大二我在院长的软件公司, 做过数据可视化, 中后台开发, 那个时候参与了一个链上辽宁的项目,  
他是为辽宁工业产业服务, 链接全国供应商, 提供供需服务, 知识图谱, 行业报告, 我在其中负责了h5行业报告开发, 活动平台开发, 
这个是用来发布招商,产业服务,发布会一些信息的平台, 应技术总监老师, 在那个时候给公司的同事 
分享前端的框架技术, 推进公司技术发展.

之后在沈航校内, 经过老师介绍, 加入博士毕业的学长的公司, 做前端开发, 
做了我沈航的教师职称评审系统负责前端和医科大学四院的实习生教务系统全栈, 
在今年4月份也是交付完成, 也算是有政府企业相关开发经验.

在之后就是今年暑期在美团实习3个月, 在搜索推荐技术中心做前端实习生, 做中后台系统开发和迭代,
负责BS系统 类似腾讯云 为美团的搜索服务提供服务器管理服务, 乐高 搜索服务召回系统. 
也为组内贡献了一些组件, 必入节点筛选编辑器

通过第一段实习我获得了实践的经验, 知道了原来做项目需要大家一起合作, 产品销售市场 开发, 
第二段实习 很感谢老学长给机会让我独立负责项目, 还做了两个, 通过和学校领导医院的老师沟通 收集需求, 确定方案, 开发
在美团实习, 了解了大厂的开发的流程,收获了大厂的实习, 实习中也个和将近10个后端和UI/产品同学沟通, 去完善我们的产品, 为客户提供优质服务,

